#+TITLE: F2 Crowd Scanning - Installation Recipe (Jetson Orin NX)
#+AUTHOR: Eduardo Torres Urbano
#+PROPERTY: header-args:bash :results output replace :exports both
#+OPTIONS: toc:2 num:nil
#+EXCLUDE_TAGS: noexport
#+STARTUP: showall

* Variables (edit these)
#+name: vars
#+begin_src bash :results output replace :exports both :session f2cs
  # --- EDIT THESE ---
  export PROJECT_DIR="/home/nvidia/projects/F2_Crowd_Scanning"
  export FACEME_DIR="$PROJECT_DIR/faceme"
  export VENV_DIR="$PROJECT_DIR/faceme_env"
  export GITHUB_REPO="https://github.com/VisiontechProjects/F2_Crowd_Scanning.git"

  # FaceMe SDK version
  export FACEME_SDK_INSTALLER="FaceMe_SDK_Jetson_JetPack513_7.0.0.run"
  export FACEME_WHEEL="FaceMe-7.0.0-py38-none-manylinux2014_aarch64.whl"

  echo "PROJECT_DIR=$PROJECT_DIR"
  echo "FACEME_DIR=$FACEME_DIR"
  echo "VENV_DIR=$VENV_DIR"
#+end_src

#+RESULTS: vars
: PROJECT_DIR=/home/nvidia/projects/F2_Crowd_Scanning
: FACEME_DIR=/home/nvidia/projects/F2_Crowd_Scanning/faceme
: VENV_DIR=/home/nvidia/projects/F2_Crowd_Scanning/faceme_env

** Step 1.3: Verify JetPack installation

#+begin_src bash :results output replace :exports both
  jtop --version || echo "jtop not found - reboot may be required"
#+end_src

#+RESULTS:
: jtop 4.3.2

Expected output:
#+begin_example
jtop 4.x.x
#+end_example

** Step 2.1: Create project directories

#+begin_src bash :results output replace :exports both
  set -euo pipefail

  mkdir -p /home/nvidia/projects
  mkdir -p /home/nvidia/tools

  echo "Directories created:"
  ls -la /home/nvidia/projects
#+end_src

#+RESULTS:
: Directories created:
: total 28
: drwxrwxr-x  7 nvidia nvidia 4096 Jan 28 12:04 .
: drwxr-xr-x 20 nvidia nvidia 4096 Jan 28 16:44 ..
: drwxr-xr-x  3 root   root   4096 Nov 13 15:33 certs
: drwxrwxr-x 12 nvidia nvidia 4096 Jan 13 17:07 F2-App
: drwxrwxr-x 12 nvidia nvidia 4096 Jan 28 15:30 F2_Crowd_Scanning
: drwxrwxr-x 11 nvidia nvidia 4096 Dec  9 13:28 F2_Crowd_Scanning_1
: drwxrwxr-x 12 nvidia nvidia 4096 Jan 20 13:03 F2_On_Premise_Solution

** Step 3.3: Make installer executable

#+begin_src bash :results output replace :exports both :session f2cs
  chmod +x "$FACEME_DIR/$FACEME_SDK_INSTALLER"
  ls -la "$FACEME_DIR"/*.run
#+end_src

#+RESULTS:
: -rwxrwxr-x 1 nvidia nvidia 1354869238 Jan 28 12:08 /home/nvidia/projects/F2_Crowd_Scanning/faceme/FaceMe_SDK_Jetson_JetPack513_7.0.0.run

*** Option A: Automated (run on Jetson terminal)

Save this script on the Jetson and execute it:

#+begin_src bash :tangle ../tools/install-faceme.sh :tangle-mode (identity #o755)
#!/bin/bash
set -euo pipefail

FACEME_DIR="/home/nvidia/projects/F2_Crowd_Scanning/faceme"

if [ -d "$FACEME_DIR/FaceMeSDK" ]; then
    echo "FaceMe SDK already installed. Skipping."
    exit 0
fi

echo "Running FaceMe SDK installer (~10 minutes)..."

expect << 'EXPECT_EOF'
set timeout 1200
spawn /home/nvidia/projects/F2_Crowd_Scanning/faceme/FaceMe_SDK_Jetson_JetPack513_7.0.0.run

expect {
    "password for*" {
        stty -echo
        expect_user -re "(.*)\n"
        stty echo
        send "$expect_out(1,string)\r"
        exp_continue
    }
    "Installation path*" {
        send "/home/nvidia/projects/F2_Crowd_Scanning/faceme\r"
        exp_continue
    }
    "*extraction models*" {
        send "VH11_M\r"
        exp_continue
    }
    "*minimum face*" {
        send "5\r"
        exp_continue
    }
    "*Demo System*" {
        send "y\r"
        exp_continue
    }
    "*Sample*code*" {
        send "y\r"
        exp_continue
    }
    "*config above*" {
        send "y\r"
        exp_continue
    }
    "completely installed" {
        puts "\n\nFaceMe SDK installation completed!"
    }
    timeout {
        puts "\n\nTimeout - check installation manually"
        exit 1
    }
    eof
}
EXPECT_EOF

echo "Done."
#+end_src

#+RESULTS:
: FaceMe SDK already installed. Skipping.

Run on Jetson:
#+begin_example
bash /home/nvidia/projects/F2_Crowd_Scanning/tools/install-faceme.sh
#+end_example
FACEME_DIR="/home/nvidia/projects/F2_Crowd_Scanning/faceme"

if [ -d "$FACEME_DIR/FaceMeSDK" ]; then
    echo "FaceMe SDK already installed. Skipping."
    exit 0
fi

echo "Running FaceMe SDK installer (~10 minutes)..."

expect << 'EXPECT_EOF'
set timeout 1200
spawn /home/nvidia/projects/F2_Crowd_Scanning/faceme/FaceMe_SDK_Jetson_JetPack513_7.0.0.run

expect {
    "password for*" {
        stty -echo
        expect_user -re "(.*)\n"
        stty echo
        send "$expect_out(1,string)\r"
        exp_continue
    }
    "Installation path*" {
        send "/home/nvidia/projects/F2_Crowd_Scanning/faceme\r"
        exp_continue
    }
    "*extraction models*" {
        send "VH11_M\r"
        exp_continue
    }
    "*minimum face*" {
        send "5\r"
        exp_continue
    }
    "*Demo System*" {
        send "y\r"
        exp_continue
    }
    "*Sample*code*" {
        send "y\r"
        exp_continue
    }
    "*config above*" {
        send "y\r"
        exp_continue
    }
    "completely installed" {
        puts "\n\nFaceMe SDK installation completed!"
    }
    timeout {
        puts "\n\nTimeout - check installation manually"
        exit 1
    }
    eof
}
EXPECT_EOF

echo "Done."
#+end_src

Run on Jetson:
#+begin_example
bash /home/nvidia/projects/F2_Crowd_Scanning/tools/install-faceme.sh
#+end_example

** Step 4.5: Verify Python environment

#+begin_src bash :results output replace :exports both :session f2cs
  echo "=== Python Version ==="
  $VENV_DIR/bin/python3 --version

  echo ""
  echo "=== FaceMe Package ==="
  $VENV_DIR/bin/pip show FaceMe

  #echo ""
  #echo "=== Installed Packages ==="
  #$VENV_DIR/bin/pip list | head -n 20
#+end_src

#+RESULTS:
#+begin_example
=== Python Version ===
Python 3.8.10

=== FaceMe Package ===
Name: FaceMe
Version: 7.0.0
Summary: A python layer API to integrate FaceMe SDK into your program for facial recognition features
Home-page: https://www.cyberlink.com/faceme
Author: CyberLink FaceMe
Author-email: FaceMe_US@cyberlink.com
License: Commercial License
Location: /home/nvidia/projects/F2_Crowd_Scanning/faceme_env/lib/python3.8/site-packages
Requires: numpy, opencv-python
Required-by:

=== Installed Packages ===
Package            Version
------------------ --------
aiohappyeyeballs   2.4.4
aiohttp            3.10.11
aiosignal          1.3.1
annotated-types    0.7.0
async-timeout      5.0.1
asyncio            4.0.0
attrs              25.3.0
certifi            2026.1.4
charset-normalizer 3.4.4
exceptiongroup     1.3.1
FaceMe             7.0.0
frozenlist         1.5.0
idna               3.11
iniconfig          2.1.0
multidict          6.1.0
numpy              1.24.4
opencv-python      4.5.3.56
packaging          26.0
ERROR: Pipe to stdout was broken
Exception ignored in: <_io.TextIOWrapper name='<stdout>' mode='w' encoding='utf-8'>
BrokenPipeError: [Errno 32] Broken pipe
#+end_example

** Step 5.5: Verify SDK activation

#+begin_src bash :results output replace :exports both :session f2cs
  cd "$FACEME_DIR/FaceMeSDK/DemoSystem/Program/"

  $VENV_DIR/bin/python3 FaceMePythonSample.py showversion
#+end_src

#+RESULTS:
: /home/nvidia/projects/F2_Crowd_Scanning/faceme_env/bin/python3: can't open file 'FaceMePythonSample.py': [Errno 2] No such file or directory

Expected output:
#+begin_example
{
  "Result": "Success",
  "SDK Version": "7.0.0",
  "Core Engine Version": "7.0.0"
}
#+end_example

